<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"production","backend":"95de86eb56543a6a2f35236d1ea454e8b48cec86c51d5b1818d1aa64871d0dbb","plan_job_ref":"Job plan #11 at https://github.com/GSA/usnotify-ssb/actions/runs/4491920440","plan_hash":"325b1d6a0a5a95e1061897733cb756aa2b7c79d2475678ba7f268007d00ab9a0","plan_text_format":"text","version":"1.34.0"} -->
Terraform plan for __production__
<details>
<summary>Plan: 2 to add, 1 to change, 2 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.broker_sms.cloudfoundry_service_broker.space_scoped_broker["gsa-tts-benefits-studio-prototyping/notify-prod"] will be destroyed
  # (because key ["gsa-tts-benefits-studio-prototyping/notify-prod"] is not in for_each map)
  - resource "cloudfoundry_service_broker" "space_scoped_broker" {
      - catalog_change                   = false -> null
      - catalog_hash                     = "aee9uT9KwrmmYNFvN_eD-HRpEeA=" -> null
      - fail_when_catalog_not_accessible = false -> null
      - id                               = "4ffe86cc-7114-4a19-b3ce-ccfa09696bc7" -> null
      - name                             = "ssb-sms-gsa-tts-benefits-studio-prototyping-notify-prod" -> null
      - password                         = (sensitive value) -> null
      - service_plans                    = {
          - "ttsnotify-sms/base" = "6e14b662-399a-4778-b7da-3230f098f20b"
        } -> null
      - services                         = {
          - "ttsnotify-sms" = "4873444c-1ba3-498b-b718-46449658ed60"
        } -> null
      - space                            = "4447d89a-9735-4d82-94e1-dc07713aa460" -> null
      - url                              = "https://ssb-sms-notify-management.app.cloud.gov" -> null
      - username                         = "88e4aa9e-8a4d-9ec4-8fba-1f7ccbf1ceb4" -> null
    }

  # module.broker_sms.cloudfoundry_service_broker.space_scoped_broker["gsa-tts-benefits-studio-prototyping/notify-production"] will be created
  + resource "cloudfoundry_service_broker" "space_scoped_broker" {
      + catalog_change                   = false
      + catalog_hash                     = (known after apply)
      + fail_when_catalog_not_accessible = false
      + id                               = (known after apply)
      + name                             = "ssb-sms-gsa-tts-benefits-studio-prototyping-notify-production"
      + password                         = (sensitive value)
      + service_plans                    = (known after apply)
      + services                         = (known after apply)
      + space                            = "4447d89a-9735-4d82-94e1-dc07713aa460"
      + url                              = "https://ssb-sms-notify-management.app.cloud.gov"
      + username                         = "88e4aa9e-8a4d-9ec4-8fba-1f7ccbf1ceb4"
    }

  # module.broker_smtp.cloudfoundry_service_broker.space_scoped_broker["gsa-tts-benefits-studio-prototyping/notify-management"] will be updated in-place
  ~ resource "cloudfoundry_service_broker" "space_scoped_broker" {
      ~ catalog_change                   = true -> false
        id                               = "7ab65f72-d3de-451b-be85-783ce2b55867"
        name                             = "ssb-smtp-gsa-tts-benefits-studio-prototyping-notify-management"
        # (8 unchanged attributes hidden)
    }

  # module.broker_smtp.cloudfoundry_service_broker.space_scoped_broker["gsa-tts-benefits-studio-prototyping/notify-prod"] will be destroyed
  # (because key ["gsa-tts-benefits-studio-prototyping/notify-prod"] is not in for_each map)
  - resource "cloudfoundry_service_broker" "space_scoped_broker" {
      - catalog_change                   = true -> null
      - catalog_hash                     = "AAUFGxXZ02rXmKpC2vmv5SRtMgg=" -> null
      - fail_when_catalog_not_accessible = false -> null
      - id                               = "f6e8d9eb-b2ca-407c-b5e0-07f9476a1f0e" -> null
      - name                             = "ssb-smtp-gsa-tts-benefits-studio-prototyping-notify-prod" -> null
      - password                         = (sensitive value) -> null
      - service_plans                    = {
          - "datagov-smtp/base" = "a1f989d2-b02e-45b6-9a4b-9a4e802fada0"
        } -> null
      - services                         = {
          - "datagov-smtp" = "0e40c1d9-6751-4391-8542-2e1d3d1af13d"
        } -> null
      - space                            = "4447d89a-9735-4d82-94e1-dc07713aa460" -> null
      - url                              = "https://ssb-smtp-notify-management.app.cloud.gov" -> null
      - username                         = "3d6c918b-7997-4b76-d9bf-c0d3878800d1" -> null
    }

  # module.broker_smtp.cloudfoundry_service_broker.space_scoped_broker["gsa-tts-benefits-studio-prototyping/notify-production"] will be created
  + resource "cloudfoundry_service_broker" "space_scoped_broker" {
      + catalog_change                   = false
      + catalog_hash                     = (known after apply)
      + fail_when_catalog_not_accessible = false
      + id                               = (known after apply)
      + name                             = "ssb-smtp-gsa-tts-benefits-studio-prototyping-notify-production"
      + password                         = (sensitive value)
      + service_plans                    = (known after apply)
      + services                         = (known after apply)
      + space                            = "4447d89a-9735-4d82-94e1-dc07713aa460"
      + url                              = "https://ssb-smtp-notify-management.app.cloud.gov"
      + username                         = "3d6c918b-7997-4b76-d9bf-c0d3878800d1"
    }

Plan: 2 to add, 1 to change, 2 to destroy.

Changes to Outputs:
  ~ client_spaces = [
        "gsa-tts-benefits-studio-prototyping/notify-management",
      - "gsa-tts-benefits-studio-prototyping/notify-prod",
      + "gsa-tts-benefits-studio-prototyping/notify-production",
    ]
```
</details>

:white_check_mark: Plan applied in [apply #12](https://github.com/GSA/usnotify-ssb/actions/runs/4493247307)